content/queztaz/emacs/emacs-with-mu4e-and-multiple-gmail-accounts/index.org
#+title: Emacs with Mu4e and Multiple Gmail Accounts
#+date: 2025-01-11T00:53:38-07:00
#+draft: false
* Emacs with Mu4e and Multiple Gmail Accounts
** Preamble
Documented steps I take to setup Mu4e with two Gmail accounts. This page will
contain the directions for using app password authentication. It will be updated
when XOAUTH2.0 is required.

* Installation

** Gmail
I'm using app passwords while they still last. Eventually this section will
contain information on setting up XOAUTH 2.0 when app passwords are fully phased
out.

Two email accounts will be added to Mu4e. Each account will have its own
"context" and account dependent keybindings.

*** Creating a Gmail App Password
- Open the Gmail account settings
- Enable two factor authentication
- Create your app password using https://myaccount.google.com/apppasswords

The app password will be used by offlineimap to sign into your Gmail
account. Create app passwords for both your email accounts.

** Compile Mu4e

The application will be compiled from source

*** Dependencies

#+begin_src bash
sudo apt install -y git meson libgmime-3.0-dev libxapian-dev gnutls-bin texinfo libcld2-dev cmake guile-3.0
#+end_src

*** Compiling Mu4e

#+begin_src bash
mkdir -p ~/Sources
git clone https://github.com/emacsmirror/mu4e ~/Sources/mu4e
cd ~/Sources/mu4e
./autogen.sh
make
sudo make install
#+end_src

*** GPG Keys (Encrypting Password)

Generate your own GPG pair. This will be used to decrypt your password by
offlineimap. Please use the full-key-gen flag instead of following the example
below. I'm creating a passwordless GPG pair. Its absolutely not secure. This
avoids having to type a passphrase to decrypt your password files

#+begin_src bash
gpg --batch --passphrase '' --quick-gen-key proton@proton.local default default
gpg --list-keys
pass init <GPGID>
#+end_src

** Offline Imap (Downloading Emails) 
OfflineImap will be used to download the emails. Emacs will be used to send the
emails using its SMTP functionality

*** Create Email Folder

Create a folder to store your emails

#+begin_src bash
mkdir -p ~/Mail/first@gmail.com
#+end_src

*** Create password decrypting script

Create the following .offlineimap.py script. This will be used in the
.offlineimaprc to decrypt our password file

#+begin_src bash
cat <<OEM > ~/.offlineimap.py
#! /usr/bin/env python
from subprocess import check_output

def get_pass(account):
    return check_output("pass email/" + account, bash=True).splitlines()[0]
OEM
#+end_src

