public/queztaz/emacs/emacs-with-mu4e-and-multiple-gmail-accounts/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link rel="icon" href="/favicon.ico" type="image/x-icon"/>
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <title>queztaz/Emacs with Mu4e and Multiple Gmail Accounts</title>
  <h1>Emacs with Mu4e and Multiple Gmail Accounts</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Emacs with Mu4e and Multiple Gmail Accounts</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Installation</a>
<ul>
<li><a href="#headline-4">Gmail</a>
<ul>
<li><a href="#headline-5">Creating a Gmail App Password</a>
</li>
</ul>
</li>
<li><a href="#headline-6">Compile Mu4e</a>
<ul>
<li><a href="#headline-7">Dependencies</a>
</li>
<li><a href="#headline-8">Compiling Mu4e</a>
</li>
<li><a href="#headline-9">GPG Keys (Encrypting Password)</a>
</li>
</ul>
</li>
<li><a href="#headline-10">Offline Imap (Downloading Emails) </a>
<ul>
<li><a href="#headline-11">Create Email Folder</a>
</li>
<li><a href="#headline-12">Create password decrypting script</a>
</li>
<li><a href="#headline-13">Create main configuration file</a>
</li>
<li><a href="#headline-14">Downloading and Indexing Emails</a>
</li>
</ul>
</li>
<li><a href="#headline-15">Configuring Emacs</a>
<ul>
<li><a href="#headline-16">Basic Config</a>
</li>
<li><a href="#headline-17">Creating .authinfo.gpg file</a>
</li>
<li><a href="#headline-18">Using Mu4e</a>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Emacs with Mu4e and Multiple Gmail Accounts
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Documented steps I take to setup Mu4e with two Gmail accounts. This page will
contain the directions for using app password authentication. It will be updated
when XOAUTH2.0 is required.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Installation
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Gmail
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>I&#39;m using app passwords while they still last. Eventually this section will
contain information on setting up XOAUTH 2.0 when app passwords are fully phased
out.</p>
<p>
Two email accounts will be added to Mu4e. Each account will have its own
&#34;context&#34; and account dependent keybindings.</p>
<div id="outline-container-headline-5" class="outline-4">
<h4 id="headline-5">
Creating a Gmail App Password
</h4>
<div id="outline-text-headline-5" class="outline-text-4">
<ul>
<li>Open the Gmail account settings</li>
<li>Enable two factor authentication</li>
<li>Create your app password using <a href="https://myaccount.google.com/apppasswords">https://myaccount.google.com/apppasswords</a></li>
</ul>
<p>The app password will be used by offlineimap to sign into your Gmail
account. Create app passwords for both your email accounts.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Compile Mu4e
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
The application will be compiled from source</p>
<div id="outline-container-headline-7" class="outline-4">
<h4 id="headline-7">
Dependencies
</h4>
<div id="outline-text-headline-7" class="outline-text-4">
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>sudo apt install -y git meson libgmime-3.0-dev libxapian-dev gnutls-bin texinfo libcld2-dev cmake guile-3.0</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-4">
<h4 id="headline-8">
Compiling Mu4e
</h4>
<div id="outline-text-headline-8" class="outline-text-4">
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>mkdir -p ~/Sources
</span></span><span style="display:flex;"><span>git clone https://github.com/emacsmirror/mu4e ~/Sources/mu4e
</span></span><span style="display:flex;"><span>cd ~/Sources/mu4e
</span></span><span style="display:flex;"><span>./autogen.sh
</span></span><span style="display:flex;"><span>make
</span></span><span style="display:flex;"><span>sudo make install</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-4">
<h4 id="headline-9">
GPG Keys (Encrypting Password)
</h4>
<div id="outline-text-headline-9" class="outline-text-4">
<p>
Generate your own GPG pair. This will be used to decrypt your password by
offlineimap. Please use the full-key-gen flag instead of following the example
below. I&#39;m creating a passwordless GPG pair. Its absolutely not secure. This
avoids having to type a passphrase to decrypt your password files</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>gpg --batch --passphrase <span style="color:#e6db74">&#39;&#39;</span> --quick-gen-key proton@proton.local default default
</span></span><span style="display:flex;"><span>gpg --list-keys
</span></span><span style="display:flex;"><span>pass init &lt;GPGID&gt;</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Offline Imap (Downloading Emails) 
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>OfflineImap will be used to download the emails. Emacs will be used to send the
emails using its SMTP functionality</p>
<div id="outline-container-headline-11" class="outline-4">
<h4 id="headline-11">
Create Email Folder
</h4>
<div id="outline-text-headline-11" class="outline-text-4">
<p>
Create a folder to store your emails</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>mkdir -p ~/Mail/first@gmail.com</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-4">
<h4 id="headline-12">
Create password decrypting script
</h4>
<div id="outline-text-headline-12" class="outline-text-4">
<p>
Create the following .offlineimap.py script. This will be used in the
.offlineimaprc to decrypt our password file</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>cat <span style="color:#e6db74">&lt;&lt;OEM &gt; ~/.offlineimap.py
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">#! /usr/bin/env python
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">from subprocess import check_output
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">def get_pass(account):
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">    return check_output(&#34;pass email/&#34; + account, bash=True).splitlines()[0]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">OEM</span></span></span></code></pre></div>
</div>
</div>
</div>
