content/queztaz/emacs/emacs-with-mu4e-and-multiple-gmail-accounts/index.org
*** Create main configuration file
Now create the main configuration used to download the emails. The only thing
you need to replace is any reference to first@gmail.com

#+begin_src bash
cat <<OEM > ~/.offlineimaprc
[general]
accounts = main, unix
maxsyncaccounts = 3
socktimeout = 60
pythonfile = ~/.offlineimap.py

ui = TTY.TTYUI

[Account main]
localrepository = main-local
remoterepository = gmail-remote

[Repository main-local]
type = Maildir
localfolders = /home/user/Mail/first@gmail.com
nametrans = lambda folder: re.sub ('important', '^\[Gmail\].Important',
                           re.sub('all', '[Gmail].All Mail'       ,
                           re.sub('sent'    , '[Gmail].Sent Mail' ,
                           re.sub('drafts'  , '[Gmail].Drafts'    ,
                           folder))))
folderfilter = lambda folder: folder not in ['important']

[Repository gmail-remote]
type = Gmail
remoteuser = first@gmail.com
remotepasseval = get_pass("first@gmail.com")

nametrans = lambda folder: re.sub ('^\[Gmail\].Important', 'important',
                           re.sub('.*All Mail$'  , 'all',
                           re.sub('.*Sent Mail$' , 'sent',
                           re.sub('.*Drafts$'    , 'drafts',
                           folder))))
folderfilter = lambda folder: folder not in ['[Gmail]/All Mail',
                                             '[Gmail]/Important',
                                             '[Gmail]/Starred']

sslcacertfile = /etc/ssl/certs/ca-certificates.crt
ssl_version = tls1_2

[Account unix]
localrepository = unix-local
remoterepository = unix-remote

[Repository unix-local]
type = Maildir
localfolders = /home/user/Mail/second@gmail.com
nametrans = lambda folder: re.sub ('important', '^\[Gmail\].Important',
                           re.sub('all', '[Gmail].All Mail'       ,
                           re.sub('sent'    , '[Gmail].Sent Mail' ,
                           re.sub('drafts'  , '[Gmail].Drafts'    ,
                           folder))))
folderfilter = lambda folder: folder not in ['important']

[Repository unix-remote]
type = Gmail
remoteuser = second@gmail.com
remotepasseval = get_pass("second@gmail.com")

nametrans = lambda folder: re.sub ('^\[Gmail\].Important', 'important',
                           re.sub('.*All Mail$'  , 'all',
                           re.sub('.*Sent Mail$' , 'sent',
                           re.sub('.*Drafts$'    , 'drafts',
                           folder))))
folderfilter = lambda folder: folder not in ['[Gmail]/All Mail',
                                             '[Gmail]/Important',
                                             '[Gmail]/Starred']

sslcacertfile = /etc/ssl/certs/ca-certificates.crt
ssl_version = tls1_2
OEM
#+end_src

*** Downloading and Indexing Emails
Run the following to commands. ~offlineimap~ is used to start the email
download. Mu will index the downloaded emails.


#+begin_src bash
offlineimap

mu init --maildir=~/Mail \
    --my-address=first@gmail.com \
    --my-address=second@gmail.com \
#+end_src

** Configuring Emacs
At this point you would have installed the emacs mu4e package from source,
downloaded your emails to a folder, and lastly indexed it with Mu4e.

Now its time to configure Emacs to show you emails in that folder. I won't
explain this configuration file. I'll leave this up to your responsibility.

This configuration file will work with your email. I stripped out the
mu4e-folding and mu4e-thread packages from the config. They provide UI
improvements to Mu4e and the installation of these plugins are out of the scope
of this guide.


