public/queztaz/emacs/emacs-with-mu4e-and-multiple-gmail-accounts/index.html
<div id="outline-container-headline-16" class="outline-4">
<h4 id="headline-16">
Basic Config
</h4>
<div id="outline-text-headline-16" class="outline-text-4">
<div class="src src-emacs-lisp">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-emacs-lisp" data-lang="emacs-lisp"><span style="display:flex;"><span><span style="color:#75715e">;; Load mu4e (Maildir email client for Emacs) if its directory exists</span>
</span></span><span style="display:flex;"><span>(when (<span style="color:#a6e22e">file-directory-p</span> <span style="color:#e6db74">&#34;/usr/local/share/emacs/site-lisp/mu4e&#34;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">;; Load mu4e and its contribution library</span>
</span></span><span style="display:flex;"><span>  (require <span style="color:#e6db74">&#39;mu4e</span>)
</span></span><span style="display:flex;"><span>  (require <span style="color:#e6db74">&#39;mu4e-contrib</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">;; --- Basic mu4e Configuration ---</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-maildir <span style="color:#e6db74">&#34;~/Mail&#34;</span>)               <span style="color:#75715e">; Root Maildir directory (where your emails are stored)</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-attachment-dir <span style="color:#e6db74">&#34;~/Downloads&#34;</span>)   <span style="color:#75715e">; Default directory for saving email attachments</span>
</span></span><span style="display:flex;"><span>  (setq message-kill-buffer-on-exit <span style="color:#66d9ef">t</span>)       <span style="color:#75715e">; Close the buffer after sending/canceling an email</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-compose-keep-self-cc <span style="color:#66d9ef">nil</span>)       <span style="color:#75715e">; Don&#39;t CC yourself when replying to your own emails</span>
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;mu4e-view-mode-hook</span> <span style="color:#a6e22e">#&#39;</span>visual-line-mode) <span style="color:#75715e">; Enable word wrapping in email view</span>
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;mu4e-compose-mode-hook</span> <span style="color:#a6e22e">#&#39;</span>(lambda () (auto-save-mode <span style="color:#ae81ff">1</span>))) <span style="color:#75715e">; Auto-save drafts</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">;; --- SMTP (Outgoing Mail) Settings ---</span>
</span></span><span style="display:flex;"><span>  (setq send-mail-function <span style="color:#e6db74">&#39;smtpmail-send-it</span>) <span style="color:#75715e">; Use `smtpmail` for sending emails</span>
</span></span><span style="display:flex;"><span>  (setq smtpmail-stream-type <span style="color:#e6db74">&#39;starttls</span>)      <span style="color:#75715e">; Use STARTTLS for secure SMTP connections</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">;; --- Email Display &amp; Rendering ---</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-html2text-command <span style="color:#e6db74">&#34;w3m -T text/html&#34;</span>) <span style="color:#75715e">; Convert HTML emails to plain text using `w3m`</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-headers-auto-update <span style="color:#66d9ef">t</span>)          <span style="color:#75715e">; Automatically refresh email headers</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-view-show-images <span style="color:#66d9ef">t</span>)             <span style="color:#75715e">; Display inline images in emails</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-use-fancy-chars <span style="color:#66d9ef">t</span>)              <span style="color:#75715e">; Use pretty symbols (e.g., arrows for threads)</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-headers-show-threads <span style="color:#66d9ef">t</span>)         <span style="color:#75715e">; Enable email threading in the headers view</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-view-fields <span style="color:#f92672">&#39;</span>(:from :to :subject :date :maildir :tags)) <span style="color:#75715e">; Fields to display in email view</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-view-hide-cited <span style="color:#66d9ef">t</span>)              <span style="color:#75715e">; Hide quoted text in email view by default</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">;; --- Composing Emails ---</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-compose-signature-auto-include <span style="color:#66d9ef">nil</span>) <span style="color:#75715e">; Don&#39;t auto-insert signature</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-compose-in-new-frame <span style="color:#66d9ef">t</span>)         <span style="color:#75715e">; Open compose window in a new frame</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-compose-dont-reply-to-self <span style="color:#66d9ef">t</span>)   <span style="color:#75715e">; Exclude self when replying to a mailing list</span>
</span></span><span style="display:flex;"><span>  (setq message-citation-line-function <span style="color:#e6db74">&#39;message-insert-formatted-citation-line</span>) <span style="color:#75715e">; Format email citations</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">;; --- Search &amp; Behavior ---</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-search-full <span style="color:#66d9ef">t</span>)                  <span style="color:#75715e">; Show all search results (no limit)</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-sent-messages-behavior <span style="color:#e6db74">&#39;delete</span>) <span style="color:#75715e">; Don&#39;t save sent emails (IMAP server handles this)</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-change-filenames-when-moving <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Required for `mbsync` compatibility</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-confirm-quit <span style="color:#66d9ef">nil</span>)               <span style="color:#75715e">; Don&#39;t ask for confirmation when quitting mu4e</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-index-cleanup <span style="color:#66d9ef">t</span>)      <span style="color:#75715e">; Remove stale entries</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-index-lazy-check <span style="color:#66d9ef">t</span>)   <span style="color:#75715e">; Only re-index if changed</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-index-updated-hook <span style="color:#66d9ef">nil</span>) <span style="color:#75715e">; Disable &#34;lazy indexing completed&#34; popup</span>
</span></span><span style="display:flex;"><span>  (advice-add <span style="color:#e6db74">&#39;mu4e--index-cleanup-finished-message</span> :override <span style="color:#a6e22e">#&#39;</span>ignore)
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">;; --- Integration with Other Tools ---</span>
</span></span><span style="display:flex;"><span>  (setq mail-user-agent <span style="color:#e6db74">&#39;mu4e-user-agent</span>)    <span style="color:#75715e">; Set mu4e as the default email client in Emacs</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-completing-read-function <span style="color:#e6db74">&#39;ivy-completing-read</span>) <span style="color:#75715e">; Use Ivy for autocompletion</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">;; --- UI &amp; Hooks ---</span>
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;minibuffer-setup-hook</span> (lambda () (setq mu4e-hide-index-messages <span style="color:#66d9ef">t</span>))) <span style="color:#75715e">; Hide mu4e logs in minibuffer</span>
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;minibuffer-exit-hook</span> (lambda () (setq mu4e-hide-index-messages <span style="color:#66d9ef">nil</span>)))) <span style="color:#75715e">; Restore logs after exiting minibuffer</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">;; Email Syncing</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(setq mu4e-get-mail-command <span style="color:#e6db74">&#34;true&#34;</span>) <span style="color:#75715e">;; Don&#39;t set a mail fetch program. Rely on independant sync</span>
</span></span><span style="display:flex;"><span>(setq mu4e-update-interval <span style="color:#ae81ff">60</span>)             <span style="color:#75715e">; Check for new emails every 60 seconds</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defvar my/offlineimap-process <span style="color:#66d9ef">nil</span>
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Tracks the OfflineIMAP process to prevent multiple instances.&#34;</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defun my/async-offlineimap-sync ()
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Run OfflineIMAP asynchronously without blocking Emacs, but avoid multiple instances.&#34;</span>
</span></span><span style="display:flex;"><span>  (interactive)
</span></span><span style="display:flex;"><span>  (unless my/offlineimap-process
</span></span><span style="display:flex;"><span>    (let ((timestamp (<span style="color:#a6e22e">current-time-string</span>))
</span></span><span style="display:flex;"><span>          (buf (<span style="color:#a6e22e">get-buffer-create</span> <span style="color:#e6db74">&#34;*offlineimap*&#34;</span>)))
</span></span><span style="display:flex;"><span>      (with-current-buffer buf
</span></span><span style="display:flex;"><span>        (read-only-mode <span style="color:#ae81ff">0</span>)
</span></span><span style="display:flex;"><span>        (<span style="color:#a6e22e">erase-buffer</span>)
</span></span><span style="display:flex;"><span>        (<span style="color:#a6e22e">insert</span> (<span style="color:#a6e22e">format</span> <span style="color:#e6db74">&#34;Starting OfflineIMAP sync at: %s\n&#34;</span> timestamp)))  <span style="color:#75715e">;; Insert timestamp into the buffer</span>
</span></span><span style="display:flex;"><span>      (setq my/offlineimap-process
</span></span><span style="display:flex;"><span>            (<span style="color:#a6e22e">start-process</span> <span style="color:#e6db74">&#34;offlineimap&#34;</span>
</span></span><span style="display:flex;"><span>                           buf
</span></span><span style="display:flex;"><span>                           <span style="color:#e6db74">&#34;offlineimap&#34;</span> <span style="color:#e6db74">&#34;-o&#34;</span>)))))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defun my/stop-offlineimap-sync ()
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Stop the OfflineIMAP process if it&#39;s running.&#34;</span>
</span></span><span style="display:flex;"><span>  (when my/offlineimap-process
</span></span><span style="display:flex;"><span>    (<span style="color:#a6e22e">delete-process</span> my/offlineimap-process)
</span></span><span style="display:flex;"><span>    (setq my/offlineimap-process <span style="color:#66d9ef">nil</span>)))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">;; Run OfflineIMAP every 45 seconds, but only if it&#39;s not already running</span>
</span></span><span style="display:flex;"><span>(run-with-timer <span style="color:#ae81ff">0</span> <span style="color:#ae81ff">45</span> <span style="color:#a6e22e">#&#39;</span>my/async-offlineimap-sync)
</span></span><span style="display:flex;"><span>(add-hook <span style="color:#e6db74">&#39;mu4e-update-mail-hook</span> <span style="color:#a6e22e">#&#39;</span>mu4e-update-index)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">;; Email Contexts</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">; This code handles which email accounts are visible in MU4E as well as configures</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">; context-aware keybindings for bookmarks.</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(setq mu4e-contexts
</span></span><span style="display:flex;"><span>      (<span style="color:#a6e22e">list</span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e">;; Office account</span>
</span></span><span style="display:flex;"><span>       (make-mu4e-context
</span></span><span style="display:flex;"><span>        :name <span style="color:#e6db74">&#34;Office&#34;</span>
</span></span><span style="display:flex;"><span>        :match-func
</span></span><span style="display:flex;"><span>        (lambda (msg)
</span></span><span style="display:flex;"><span>          (when msg
</span></span><span style="display:flex;"><span>            (string-prefix-p <span style="color:#e6db74">&#34;/first@gmail.com&#34;</span> (mu4e-message-field msg :maildir))))
</span></span><span style="display:flex;"><span>        :vars <span style="color:#f92672">&#39;</span>((user-mail-address <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;first@gmail.com&#34;</span>)
</span></span><span style="display:flex;"><span>                (<span style="color:#a6e22e">user-full-name</span>    <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;First Last&#34;</span>)
</span></span><span style="display:flex;"><span>                (mu4e-drafts-folder  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;/first@gmail.com/drafts&#34;</span>)
</span></span><span style="display:flex;"><span>                (mu4e-sent-folder    <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;/first@gmail.com/sent&#34;</span>)
</span></span><span style="display:flex;"><span>                (mu4e-refile-folder  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;/first@gmail.com/[Gmail]/All Mail&#34;</span>)
</span></span><span style="display:flex;"><span>                (mu4e-trash-folder   <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;/first@gmail.com/[Gmail].Trash&#34;</span>)
</span></span><span style="display:flex;"><span>                (smtpmail-smtp-server <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;smtp.gmail.com&#34;</span>)
</span></span><span style="display:flex;"><span>                (smtpmail-smtp-service <span style="color:#f92672">.</span> <span style="color:#ae81ff">587</span>)
</span></span><span style="display:flex;"><span>                <span style="color:#75715e">;; (mu4e-sent-messages-behavior . &#39;delete)</span>
</span></span><span style="display:flex;"><span>                (mu4e-compose-reply-ignore-address <span style="color:#f92672">.</span> <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;no-?reply&#34;</span> <span style="color:#e6db74">&#34;first@gmail.com&#34;</span>))
</span></span><span style="display:flex;"><span>                (mu4e-maildir-shortcuts <span style="color:#f92672">.</span> ((<span style="color:#e6db74">&#34;/first@gmail.com/INBOX&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?i</span>)
</span></span><span style="display:flex;"><span>                                           (<span style="color:#e6db74">&#34;/first@gmail.com/sent&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?s</span>)
</span></span><span style="display:flex;"><span>                                           (<span style="color:#e6db74">&#34;/first@gmail.com/[Gmail].Trash&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?t</span>)
</span></span><span style="display:flex;"><span>                                           (<span style="color:#e6db74">&#34;/first@gmail.com/[Gmail].Spam&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?j</span>)
</span></span><span style="display:flex;"><span>                                           (<span style="color:#e6db74">&#34;/first@gmail.com/drafts&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?d</span>)))))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e">;; UnixFandom account</span>
</span></span><span style="display:flex;"><span>       (make-mu4e-context
</span></span><span style="display:flex;"><span>        :name <span style="color:#e6db74">&#34;Queztaz&#34;</span>
</span></span><span style="display:flex;"><span>        :match-func
</span></span><span style="display:flex;"><span>        (lambda (msg)
</span></span><span style="display:flex;"><span>          (when msg
</span></span><span style="display:flex;"><span>            (string-prefix-p <span style="color:#e6db74">&#34;/second@gmail.com&#34;</span> (mu4e-message-field msg :maildir))))
</span></span><span style="display:flex;"><span>        :vars <span style="color:#f92672">&#39;</span>((user-mail-address <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;second@gmail.com&#34;</span>)
</span></span><span style="display:flex;"><span>                (<span style="color:#a6e22e">user-full-name</span>    <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;First Last&#34;</span>)
</span></span><span style="display:flex;"><span>                (mu4e-drafts-folder  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;/second@gmail.com/drafts&#34;</span>)
</span></span><span style="display:flex;"><span>                (mu4e-sent-folder    <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;/second@gmail.com/sent&#34;</span>)
</span></span><span style="display:flex;"><span>                (mu4e-refile-folder  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;/second@gmail.com/[Gmail]/All Mail&#34;</span>)
</span></span><span style="display:flex;"><span>                (mu4e-trash-folder   <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;/second@gmail.com/[Gmail].Trash&#34;</span>)
</span></span><span style="display:flex;"><span>                (smtpmail-smtp-server <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;smtp.gmail.com&#34;</span>)
</span></span><span style="display:flex;"><span>                (smtpmail-smtp-service <span style="color:#f92672">.</span> <span style="color:#ae81ff">587</span>)
</span></span><span style="display:flex;"><span>                <span style="color:#75715e">;; (mu4e-sent-messages-behavior . &#39;delete)</span>
</span></span><span style="display:flex;"><span>                (mu4e-compose-reply-ignore-address <span style="color:#f92672">.</span> <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;no-?reply&#34;</span> <span style="color:#e6db74">&#34;second@gmail.com&#34;</span>))
</span></span><span style="display:flex;"><span>                (mu4e-maildir-shortcuts <span style="color:#f92672">.</span> ((<span style="color:#e6db74">&#34;/second@gmail.com/INBOX&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?u</span>)
</span></span><span style="display:flex;"><span>                                           (<span style="color:#e6db74">&#34;/second@gmail.com/sent&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?S</span>)
</span></span><span style="display:flex;"><span>                                           (<span style="color:#e6db74">&#34;/second@gmail.com/[Gmail].Trash&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?T</span>)
</span></span><span style="display:flex;"><span>                                           (<span style="color:#e6db74">&#34;/second@gmail.com/[Gmail].Spam&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?J</span>)
</span></span><span style="display:flex;"><span>                                           (<span style="color:#e6db74">&#34;/second@gmail.com/drafts&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?D</span>)))))))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defvar my/mu4e-bookmarks-by-context
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">&#39;</span>((<span style="color:#e6db74">&#34;Office&#34;</span>
</span></span><span style="display:flex;"><span>     <span style="color:#f92672">.</span> ((:name <span style="color:#e6db74">&#34;Inbox&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/first@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?i</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Unread&#34;</span> :query <span style="color:#e6db74">&#34;flag:unread and maildir:/first@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?u</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;All Mail&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/first@gmail.com/&#34;</span> :key <span style="color:#e6db74">?a</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Sent&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/first@gmail.com/sent&#34;</span> :key <span style="color:#e6db74">?s</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Drafts&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/first@gmail.com/drafts&#34;</span> :key <span style="color:#e6db74">?d</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Spam&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/first@gmail.com/[Gmail].Spam&#34;</span> :key <span style="color:#e6db74">?j</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Trash&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/first@gmail.com/[Gmail].Trash&#34;</span> :key <span style="color:#e6db74">?t</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Last 7 Days&#34;</span> :query <span style="color:#e6db74">&#34;date:7d..now and maildir:/first@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?7</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;PDFs&#34;</span> :query <span style="color:#e6db74">&#34;mime:application/pdf and maildir:/first@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?p</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Images&#34;</span> :query <span style="color:#e6db74">&#34;mime:image/* and maildir:/first@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?i</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;With Calendar Event&#34;</span> :query <span style="color:#e6db74">&#34;mime:text/calendar and maildir:/first@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?c</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;With Word Docs&#34;</span> :query <span style="color:#e6db74">&#34;mime:application/msword  OR mime:application/vnd.openxmlformats-officedocument.wordprocessingml.document and maildir:/first@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?w</span>)
</span></span><span style="display:flex;"><span>))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    (<span style="color:#e6db74">&#34;Queztaz&#34;</span>
</span></span><span style="display:flex;"><span>     <span style="color:#f92672">.</span> ((:name <span style="color:#e6db74">&#34;Inbox&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/second@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?i</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Unread&#34;</span> :query <span style="color:#e6db74">&#34;flag:unread and maildir:/second@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?u</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;All Mail&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/second@gmail.com/&#34;</span> :key <span style="color:#e6db74">?a</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Sent&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/second@gmail.com/sent&#34;</span> :key <span style="color:#e6db74">?s</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Drafts&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/second@gmail.com/drafts&#34;</span> :key <span style="color:#e6db74">?d</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Spam&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/second@gmail.com/[Gmail].Spam&#34;</span> :key <span style="color:#e6db74">?j</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Trash&#34;</span> :query <span style="color:#e6db74">&#34;maildir:/second@gmail.com/[Gmail].Trash&#34;</span> :key <span style="color:#e6db74">?t</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;Last 7 Days&#34;</span> :query <span style="color:#e6db74">&#34;date:7d..now and maildir:/second@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?7</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;PDFs&#34;</span> :query <span style="color:#e6db74">&#34;mime:application/pdf and maildir:/second@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?p</span>)
</span></span><span style="display:flex;"><span>       (:name <span style="color:#e6db74">&#34;Images&#34;</span> :query <span style="color:#e6db74">&#34;mime:image/* and maildir:/second@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?i</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;With Calendar Event&#34;</span> :query <span style="color:#e6db74">&#34;mime:text/calendar and maildir:/second@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?c</span>)
</span></span><span style="display:flex;"><span>        (:name <span style="color:#e6db74">&#34;With Word Docs&#34;</span> :query <span style="color:#e6db74">&#34;mime:application/msword  OR mime:application/vnd.openxmlformats-officedocument.wordprocessingml.document and maildir:/second@gmail.com/INBOX&#34;</span> :key <span style="color:#e6db74">?w</span>)
</span></span><span style="display:flex;"><span>))))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defun my/update-mu4e-bookmarks-based-on-context (context-name)
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Update `mu4e-bookmarks` when switching context.&#34;</span>
</span></span><span style="display:flex;"><span>  (let ((bookmarks (<span style="color:#a6e22e">cdr</span> (<span style="color:#a6e22e">assoc</span> context-name my/mu4e-bookmarks-by-context))))
</span></span><span style="display:flex;"><span>    (when bookmarks
</span></span><span style="display:flex;"><span>      (setq mu4e-bookmarks bookmarks))))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(add-hook <span style="color:#e6db74">&#39;mu4e-context-changed-hook</span>
</span></span><span style="display:flex;"><span>          (lambda ()
</span></span><span style="display:flex;"><span>            (my/update-mu4e-bookmarks-based-on-context
</span></span><span style="display:flex;"><span>             (mu4e-context-name (mu4e-context-current)))))</span></span></code></pre></div>
</div>
</div>
</div>
