content/queztaz/emacs/emacs-with-mu4e-and-multiple-gmail-accounts/index.org
*** Creating .authinfo.gpg file
This file will contain your SMTP password used by emacs to send emails.


#+begin_src shell
machine smtp.gmail.com login first@gmail.com password PASSWORDHERE port 587 
machine smtp.gmail.com login second@gmail.com password PASSWORDHERE port 587 
#+end_src


*** Using Mu4e

Evaluate the code blocks above and launch Mu4e

#+begin_src 
M-x mu4e
#+end_src
