public/queztaz/emacs/emacs-with-mu4e-and-multiple-gmail-accounts/index.html
<div id="outline-container-headline-17" class="outline-4">
<h4 id="headline-17">
Creating .authinfo.gpg file
</h4>
<div id="outline-text-headline-17" class="outline-text-4">
<p>This file will contain your SMTP password used by emacs to send emails.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>machine smtp.gmail.com login first@gmail.com password PASSWORDHERE port <span style="color:#ae81ff">587</span> 
</span></span><span style="display:flex;"><span>machine smtp.gmail.com login second@gmail.com password PASSWORDHERE port <span style="color:#ae81ff">587</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-18" class="outline-4">
<h4 id="headline-18">
Using Mu4e
</h4>
<div id="outline-text-headline-18" class="outline-text-4">
<p>
Evaluate the code blocks above and launch Mu4e</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>M-x mu4e</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
